app/controllers/notes_controller.rb

  def index
    @notes = Note.all
---
SELECT * FROM "notes"

  def show
    @note = Note.find(params[:id])
---
SELECT * FROM "notes" WHERE ("notes"."id" = 1)

  def create
    @note = Note.new(params[:note])
    @post = @note.post
    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("name", "body", "post_id", "created_at", "updated_at") VALUES('note 1', 'Finally something in the right direction!', NULL, '2010-04-29 08:34:36', '2010-04-29 08:34:36')

  def destroy
    @note = Note.find(params[:id])
    @note.destroy
---
SELECT * FROM "notes" WHERE ("notes"."id" = 6)
DELETE FROM "notes" WHERE "id" = 6