app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES('New Post', 'Trying to see if this works post body.', '2010-04-25 20:40:04', '2010-04-25 20:40:04')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "body" = 'Trying to see if this works post body. What happens when the text goes long like thiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiissssssssss?', "updated_at" = '2010-04-25 20:41:12' WHERE "id" = 1